app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `login` = 'gaspar paul'
 LIMIT 1
---
            }

            // Recherche dans UserModel
            $user = $UserModel->where('login', strtolower($login))->first();