app/Models/ClassModel.php

SELECT *
FROM `class`
WHERE `status_class` = 0
AND `etat_class` = 'actif'
AND `class_id` = '4'
---
    public function getOneClass($class_id){
        $builder = $this->db->table('class');
        $builder->select("*");
        $builder->where('status_class', 0);
        $builder->where('etat_class', 'actif');
        $builder->where('class_id', $class_id);

        $res  = $builder->get();

SELECT *
FROM `class`
WHERE `status_class` = 0
AND `etat_class` = 'actif'
---
    public function getAllClass(){
        $builder = $this->db->table('class');
        $builder->select('*');
        $builder->where('status_class', 0);
        $builder->where('etat_class', 'actif');

        $res  = $builder->get();

SELECT `class`.`class_id`, `class`.`name`
FROM `class`
INNER JOIN `student_class` ON `student_class`.`class_id` = `class`.`class_id`
INNER JOIN `student` ON `student`.`student_id` = `student_class`.`student_id`
INNER JOIN `year` ON `year`.`year_id` = `student_class`.`year_id`
WHERE `student_class`.`year_id` = 1
AND `student_class`.`status_stu_class` = 0
AND `student_class`.`etat_stu_class` = 'actif'
AND `student`.`status_student` = 0
AND `student`.`etat_student` = 'actif'
AND `class`.`class_id` = 1
AND `class`.`status_class` = 0
AND `class`.`etat_class` = 'actif'
---
    public function getClassAllStudentYearClass($id_year, $id_class){
        $builder = $this->db->table('class');
        $builder->select('class.class_id, class.name');
        $builder->join("student_class", "student_class.class_id = class.class_id", "inner");
        $builder->join("student", "student.student_id = student_class.student_id", "inner");
        $builder->join("year", "year.year_id = student_class.year_id", "inner");

        $builder->where('student_class.year_id', $id_year);
        $builder->where('student_class.status_stu_class', 0);
        $builder->where('student_class.etat_stu_class', 'actif');
        $builder->where('student.status_student', 0);
        $builder->where('student.etat_student', 'actif');

        $builder->where('class.class_id', $id_class);
        $builder->where('class.status_class', 0);
        $builder->where('class.etat_class', 'actif');

        $res  = $builder->get();

SELECT `class`.`class_id`, `class`.`name`
FROM `class`
INNER JOIN `student_class` ON `student_class`.`class_id` = `class`.`class_id`
INNER JOIN `student` ON `student`.`student_id` = `student_class`.`student_id`
INNER JOIN `year` ON `year`.`year_id` = `student_class`.`year_id`
WHERE `student_class`.`year_id` = 1
AND `student_class`.`status_stu_class` = 0
AND `student_class`.`redouble` = 'oui'
AND `student_class`.`etat_stu_class` = 'actif'
AND `student`.`status_student` = 0
AND `student`.`etat_student` = 'actif'
AND `class`.`class_id` = 1
AND `class`.`status_class` = 0
AND `class`.`etat_class` = 'actif'
---
    public function getRedoubleStudentYearByClass($id_year, $id_class){
        $builder = $this->db->table('class');
        $builder->select('class.class_id, class.name');
        $builder->join("student_class", "student_class.class_id = class.class_id", "inner");
        $builder->join("student", "student.student_id = student_class.student_id", "inner");
        $builder->join("year", "year.year_id = student_class.year_id", "inner");

        $builder->where('student_class.year_id', $id_year);
        $builder->where('student_class.status_stu_class', 0);
        $builder->where('student_class.redouble', 'oui');
        $builder->where('student_class.etat_stu_class', 'actif');
        $builder->where('student.status_student', 0);
        $builder->where('student.etat_student', 'actif');

        $builder->where('class.class_id', $id_class);
        $builder->where('class.status_class', 0);
        $builder->where('class.etat_class', 'actif');

        $res  = $builder->get();

SELECT `class`.`class_id`, `class`.`name`
FROM `class`
INNER JOIN `student_class` ON `student_class`.`class_id` = `class`.`class_id`
INNER JOIN `student` ON `student`.`student_id` = `student_class`.`student_id`
INNER JOIN `year` ON `year`.`year_id` = `student_class`.`year_id`
WHERE `student_class`.`year_id` = 1
AND `student_class`.`status_stu_class` = 0
AND `student_class`.`etat_stu_class` = 'actif'
AND `student`.`status_student` = 0
AND `student`.`etat_student` = 'actif'
AND `student`.`sexe` = 'F'
AND `class`.`class_id` = 1
AND `class`.`status_class` = 0
AND `class`.`etat_class` = 'actif'
---
    public function getSexeStudentYearByClass($id_year, $id_class, $sexe){
        $builder = $this->db->table('class');
        $builder->select('class.class_id, class.name');
        $builder->join("student_class", "student_class.class_id = class.class_id", "inner");
        $builder->join("student", "student.student_id = student_class.student_id", "inner");
        $builder->join("year", "year.year_id = student_class.year_id", "inner");

        $builder->where('student_class.year_id', $id_year);
        $builder->where('student_class.status_stu_class', 0);
        $builder->where('student_class.etat_stu_class', 'actif');
        $builder->where('student.status_student', 0);
        $builder->where('student.etat_student', 'actif');
        $builder->where('student.sexe', $sexe);

        $builder->where('class.class_id', $id_class);
        $builder->where('class.status_class', 0);
        $builder->where('class.etat_class', 'actif');

        $res  = $builder->get();