app/Models/CycleModel.php

    public function getCycleById($cycle_id){
        $builder = $this->db->table('cycle');
        $builder->select("*");
        $builder->where('cycle.cycle_id', $cycle_id);
        $builder->where('cycle.status_cycle', 0);
        $builder->where('cycle.etat_cycle', 'actif');

        $res  = $builder->get();
---
SELECT *
FROM `cycle`
WHERE `cycle`.`cycle_id` = '1'
AND `cycle`.`status_cycle` = 0
AND `cycle`.`etat_cycle` = 'actif'