app/Models/FonctionnalityUserModel.php

    public function getFonctUser($id_user){
        $builder = $this->db->table('fonctionnalityuser');
        $builder->select('fonctionnalityuser.id_fonctionnalityuser, fonctionnalityuser.id_user, fonctionnalityuser.status_fonct_user, fonctionnalityuser.etat_fonct_user, fonctionnalityuser.created_at, fonctionnalityuser.updated_at, fonctionnalityuser.deleted_at');
        $builder->join('user', 'user.id_user = fonctionnalityuser.id_user', "inner");
        $builder->join('fonctionnality', 'fonctionnality.id_fonctionnality = fonctionnalityuser.id_fonctionnality', "inner");
        $builder->where('fonctionnalityuser.id_user', $id_user);
        $builder->where('status_fonct_user', 0);
        $builder->where('etat_fonct_user', 'actif');
        $builder->where('status_user', 0);
        $builder->where('status_fonc', 0);
        $builder->where('etat_user', 'actif');
        $builder->where('etat_fonc', 'actif');

        $res = $builder->get();
---
SELECT `fonctionnalityuser`.`id_fonctionnalityuser`, `fonctionnalityuser`.`id_user`, `fonctionnalityuser`.`status_fonct_user`, `fonctionnalityuser`.`etat_fonct_user`, `fonctionnalityuser`.`created_at`, `fonctionnalityuser`.`updated_at`, `fonctionnalityuser`.`deleted_at`
FROM `fonctionnalityuser`
INNER JOIN `user` ON `user`.`id_user` = `fonctionnalityuser`.`id_user`
INNER JOIN `fonctionnality` ON `fonctionnality`.`id_fonctionnality` = `fonctionnalityuser`.`id_fonctionnality`
WHERE `fonctionnalityuser`.`id_user` = 1
AND `status_fonct_user` = 0
AND `etat_fonct_user` = 'actif'
AND `status_user` = 0
AND `status_fonc` = 0
AND `etat_user` = 'actif'
AND `etat_fonc` = 'actif'