app/Models/LicenceModel.php

    public function getLicenceDescBySchool($id_school){
        $builder = $this->db->table('licence');
        $builder->select('licence.licence_id, licence.date_debut, licence.date_fin, licence.id_user, licence.school_id, licence.status_licence, licence.etat_licence, licence.created_at, licence.updated_at, licence.deleted_at');
        $builder->join('school', 'school.school_id=licence.school_id', 'inner');
        $builder->where('licence.school_id', $id_school);
        $builder->where('licence.status_licence', 0);
        $builder->where('licence.etat_licence', 'actif');
        $builder->where('school.status_school', 0);
        $builder->where('school.etat_school', 'actif');
        $builder->orderBy('licence.licence_id', 'DESC');

        $res  = $builder->get();
---
SELECT `licence`.`licence_id`, `licence`.`date_debut`, `licence`.`date_fin`, `licence`.`id_user`, `licence`.`school_id`, `licence`.`status_licence`, `licence`.`etat_licence`, `licence`.`created_at`, `licence`.`updated_at`, `licence`.`deleted_at`
FROM `licence`
INNER JOIN `school` ON `school`.`school_id`=`licence`.`school_id`
WHERE `licence`.`school_id` = 1
AND `licence`.`status_licence` = 0
AND `licence`.`etat_licence` = 'actif'
AND `school`.`status_school` = 0
AND `school`.`etat_school` = 'actif'
ORDER BY `licence`.`licence_id` DESC