app/Models/NoteModel.php

SELECT `note`.`close`, `note`.`note_id`, `note`.`note`, `note`.`student_id`, `note`.`teachingunit_id`, `note`.`year_id`, `note`.`sequence_id`, `note`.`status_note`, `note`.`etat_note`, `note`.`status_note`, `note`.`created_at`, `note`.`updated_at`, `note`.`deleted_at`
FROM `note`
WHERE `note`.`student_id` = 488
AND `note`.`teachingunit_id` = '1'
AND `note`.`year_id` = 1
AND `note`.`status_note` = 0
AND `note`.`etat_note` = 'actif'
---
    public function getNoteByStudent($student_id, $id_teaching_unit, $year_id, $id_sequence){
        $builder = $this->db->table('note');
        $builder->select('note.close, note.note_id, note.note, note.student_id, note.teachingunit_id, note.year_id, note.sequence_id, note.status_note, note.etat_note, note.status_note, note.created_at, note.updated_at, note.deleted_at');

        $builder->where('note.student_id',  $student_id);
        $builder->where('note.teachingunit_id',  $id_teaching_unit);
        $builder->where('note.year_id',  $year_id);
        $builder->where('note.status_note', 0);
        $builder->where('note.etat_note', 'actif');

        $res  = $builder->get();