app/Models/SalaireModel.php

SELECT SUM(salaire.montant) as total
FROM `salaire`
INNER JOIN `teacher` ON `teacher`.`teacher_id` = `salaire`.`teacher_id`
INNER JOIN `teacher_school` ON `teacher_school`.`teacher_id` = `teacher`.`teacher_id`
INNER JOIN `school` ON `school`.`school_id` = `teacher_school`.`school_id`
INNER JOIN `year` ON `year`.`year_id` = `salaire`.`year_id`
WHERE `teacher`.`year_id` = 1
AND `teacher`.`status_teacher` = 0
AND `teacher`.`etat_teacher` = 'actif'
AND `teacher_school`.`status_teacher_school` = 0
AND `teacher_school`.`etat_teacher_school` = 'actif'
AND `school`.`status_school` = 0
AND `school`.`etat_school` = 'actif'
AND `salaire`.`status_salaire` = 0
AND `salaire`.`etat_salaire` = 'actif'
---
    public function getSumAllSalaireShool($year_id){
        $builder = $this->db->table('salaire');
        $builder->select('SUM(salaire.montant) as total');
        $builder->join("teacher", "teacher.teacher_id = salaire.teacher_id", "inner");
        $builder->join("teacher_school", "teacher_school.teacher_id = teacher.teacher_id", "inner");
        $builder->join("school", "school.school_id = teacher_school.school_id", "inner");
        $builder->join("year", "year.year_id = salaire.year_id", "inner");

        $builder->where('teacher.year_id', $year_id);
        $builder->where('teacher.status_teacher', 0);
        $builder->where('teacher.etat_teacher', 'actif');

        $builder->where('teacher_school.status_teacher_school', 0);
        $builder->where('teacher_school.etat_teacher_school', 'actif');

        $builder->where('school.status_school', 0);
        $builder->where('school.etat_school', 'actif');

        $builder->where('salaire.status_salaire', 0);
        $builder->where('salaire.etat_salaire', 'actif');

        $res  = $builder->get();