app/Models/SchoolModel.php

SELECT *
FROM `school`
WHERE `school_id` = '1'
AND `status_school` = 0
AND `etat_school` = 'actif'
---
    public function getIDSchool($id_school){
        $builder = $this->db->table('school');
        $builder->select("*");
        $builder->where('school_id', $id_school);
        $builder->where('status_school', 0);
        $builder->where('etat_school', 'actif');

        $res  = $builder->get();

SELECT *
FROM `school`
WHERE `status_school` = 0
AND `etat_school` = 'actif'
ORDER BY `name` ASC
---
    public function findAllSchool(){
        $builder = $this->db->table('school');
        $builder->select("*");
        $builder->where('status_school', 0);
        $builder->where('etat_school', 'actif');
        $builder->orderBy('name', 'ASC');

        $res = $builder->get();

SELECT *
FROM `school`
WHERE `school_id` = '1'
AND `status_school` = 0
AND `etat_school` = 'actif'
---
    public function findAllSchoolByidSchool($id_school){
        $builder = $this->db->table('school');
        $builder->select("*");
        $builder->where('school_id', $id_school);
        $builder->where('status_school', 0);
        $builder->where('etat_school', 'actif');

        $res = $builder->get();