app/Models/StudentClassModel.php

SELECT `student`.`student_id`, `student`.`surname`, `student`.`name`, `student`.`birth_place`, `student`.`date_of_birth`, `student`.`photo`, `student`.`nationality`, `student`.`sexe`, `student`.`matricule`, `student`.`status_student`, `student`.`etat_student`, `student`.`year_id`, `student`.`parent_id`, `student`.`created_at`, `student`.`updated_at`, `student`.`deleted_at`
FROM `student_class`
INNER JOIN `student` ON `student`.`student_id` = `student_class`.`student_id`
INNER JOIN `year` ON `year`.`year_id` = `student_class`.`year_id`
INNER JOIN `class` ON `class`.`class_id` = `student_class`.`class_id`
WHERE `student_class`.`class_id` = '6'
AND `student_class`.`year_id` = 1
AND `student_class`.`status_stu_class` = 0
AND `student_class`.`etat_stu_class` = 'actif'
AND `class`.`status_class` = 0
AND `class`.`etat_class` = 'actif'
AND `student`.`status_student` = 0
AND `student`.`etat_student` = 'actif'
---
    public function getStudentByClass($id_class, $year_id){
        $builder = $this->db->table('student_class');
        $builder->select('student.student_id, student.surname, student.name, student.birth_place, student.date_of_birth, student.photo, student.nationality, student.sexe, student.matricule, student.status_student, student.etat_student, student.year_id, student.parent_id, student.created_at, student.updated_at, student.deleted_at');
        $builder->join('student', 'student.student_id = student_class.student_id', 'inner');
        $builder->join('year', 'year.year_id = student_class.year_id', 'inner');
        $builder->join('class', 'class.class_id = student_class.class_id', 'inner');

        $builder->where('student_class.class_id', $id_class);
        $builder->where('student_class.year_id', $year_id);
        $builder->where('student_class.status_stu_class', 0);
        $builder->where('student_class.etat_stu_class', 'actif');

        $builder->where('class.status_class', 0);
        $builder->where('class.etat_class', 'actif');

        $builder->where('student.status_student', 0);
        $builder->where('student.etat_student', 'actif');

        $res  = $builder->get();