app/Models/StudentModel.php

    public function getAllStudent(){
        $builder = $this->db->table('student');
        $builder->select('*');
        $builder->where('status_student', 0);
        $builder->where('etat_student', 'actif');

        $res  = $builder->get();
---
SELECT *
FROM `student`
WHERE `status_student` = 0
AND `etat_student` = 'actif'

    public function getStudentByClassYearRedouble($id_class, $year_id, $redouble){
        $builder = $this->db->table('student');
        $builder->select('student.student_id, student.surname, student.name, student.birth_place, student.date_of_birth, student.photo, student.nationality, student.sexe, student.matricule, student.status_student, student.etat_student, student.year_id, student.parent_id, student.created_at, student.updated_at, student.deleted_at, parent.name_parent, parent.surnameParent, parent.contactParent, student_class.redouble');
        $builder->join("student_class", "student_class.student_id = student.student_id", "inner");
        $builder->join("class", "class.class_id = student_class.class_id", "inner");
        $builder->join("parent", "parent.parent_id = student.parent_id", "inner");
        $builder->join("year", "year.year_id = student_class.year_id", "inner");

        $builder->where('student_class.redouble', $redouble);
        $builder->where('student_class.year_id', $year_id);
        $builder->where('student_class.class_id', $id_class);
        $builder->where('student_class.status_stu_class', 0);
        $builder->where('student_class.etat_stu_class', 'actif');
        $builder->where('student.status_student', 0);
        $builder->where('student.etat_student', 'actif');
        $builder->where('class.status_class', 0);
        $builder->where('class.etat_class', 'actif');
        $builder->where('parent.status_parent', 0);
        $builder->where('parent.etat_parent', 'actif');
        $builder->orderBy('student.name', 'ASC');

        $res  = $builder->get();
---
SELECT `student`.`student_id`, `student`.`surname`, `student`.`name`, `student`.`birth_place`, `student`.`date_of_birth`, `student`.`photo`, `student`.`nationality`, `student`.`sexe`, `student`.`matricule`, `student`.`status_student`, `student`.`etat_student`, `student`.`year_id`, `student`.`parent_id`, `student`.`created_at`, `student`.`updated_at`, `student`.`deleted_at`, `parent`.`name_parent`, `parent`.`surnameParent`, `parent`.`contactParent`, `student_class`.`redouble`
FROM `student`
INNER JOIN `student_class` ON `student_class`.`student_id` = `student`.`student_id`
INNER JOIN `class` ON `class`.`class_id` = `student_class`.`class_id`
INNER JOIN `parent` ON `parent`.`parent_id` = `student`.`parent_id`
INNER JOIN `year` ON `year`.`year_id` = `student_class`.`year_id`
WHERE `student_class`.`year_id` = 1
AND `student_class`.`class_id` = '4'
AND `student_class`.`status_stu_class` = 0
AND `student_class`.`etat_stu_class` = 'actif'
AND `student`.`status_student` = 0
AND `student`.`etat_student` = 'actif'
AND `class`.`status_class` = 0
AND `class`.`etat_class` = 'actif'
AND `parent`.`status_parent` = 0
AND `parent`.`etat_parent` = 'actif'
ORDER BY `student`.`name` ASC

    public function getStudentBySchoolYear($id_school, $year_id){
        $builder = $this->db->table('student');
        $builder->select('student.student_id, student.surname, student.name, student.birth_place, student.date_of_birth, student.photo, student.nationality, student.sexe, student.matricule, student.status_student, student.etat_student, student.year_id, student.parent_id, student.created_at, student.updated_at, student.deleted_at');
        $builder->join("student_school", "student_school.student_id = student.student_id", "inner");
        $builder->join("school", "school.school_id = student_school.school_id", "inner");
        $builder->join("year", "year.year_id = student_school.year_id", "inner");

        $builder->where('student_school.year_id', $year_id);
        $builder->where('student_school.school_id', $id_school);
        $builder->where('student_school.status_stu_scho', 0);
        $builder->where('student_school.etat_stu_scho', 'actif');
        $builder->where('student.status_student', 0);
        $builder->where('student.etat_student', 'actif');

        $builder->where('school.status_school', 0);
        $builder->where('school.etat_school', 'actif');
        $builder->orderBy('student.name', 'ASC');

        $res  = $builder->get();
---
SELECT `student`.`student_id`, `student`.`surname`, `student`.`name`, `student`.`birth_place`, `student`.`date_of_birth`, `student`.`photo`, `student`.`nationality`, `student`.`sexe`, `student`.`matricule`, `student`.`status_student`, `student`.`etat_student`, `student`.`year_id`, `student`.`parent_id`, `student`.`created_at`, `student`.`updated_at`, `student`.`deleted_at`
FROM `student`
INNER JOIN `student_school` ON `student_school`.`student_id` = `student`.`student_id`
INNER JOIN `school` ON `school`.`school_id` = `student_school`.`school_id`
INNER JOIN `year` ON `year`.`year_id` = `student_school`.`year_id`
WHERE `student_school`.`year_id` = 1
AND `student_school`.`school_id` = '1'
AND `student_school`.`status_stu_scho` = 0
AND `student_school`.`etat_stu_scho` = 'actif'
AND `student`.`status_student` = 0
AND `student`.`etat_student` = 'actif'
AND `school`.`status_school` = 0
AND `school`.`etat_school` = 'actif'
ORDER BY `student`.`name` ASC