app/Models/StudentModel.php

SELECT `student`.`student_id`, `student`.`surname`, `student`.`name`, `student`.`birth_place`, `student`.`date_of_birth`, `student`.`photo`, `student`.`nationality`, `student`.`sexe`, `student`.`matricule`, `student`.`status_student`, `student`.`etat_student`, `student`.`year_id`, `student`.`parent_id`, `student`.`created_at`, `student`.`updated_at`, `student`.`deleted_at`, `parent`.`name_parent`, `parent`.`surnameParent`, `parent`.`contactParent`, `student_class`.`redouble`
FROM `student`
INNER JOIN `student_class` ON `student_class`.`student_id` = `student`.`student_id`
INNER JOIN `class` ON `class`.`class_id` = `student_class`.`class_id`
INNER JOIN `parent` ON `parent`.`parent_id` = `student`.`parent_id`
INNER JOIN `year` ON `year`.`year_id` = `student_class`.`year_id`
WHERE `student_class`.`year_id` = 1
AND `student_class`.`class_id` = '4'
AND `student_class`.`status_stu_class` = 0
AND `student_class`.`etat_stu_class` = 'actif'
AND `student`.`sexe` = 'M'
AND `student`.`status_student` = 0
AND `student`.`etat_student` = 'actif'
AND `class`.`status_class` = 0
AND `class`.`etat_class` = 'actif'
AND `parent`.`status_parent` = 0
AND `parent`.`etat_parent` = 'actif'
ORDER BY `student`.`name` ASC
---
    public function getStudentByClassYearSexeAll($id_class, $year_id, $sexe){
        $builder = $this->db->table('student');
        $builder->select('student.student_id, student.surname, student.name, student.birth_place, student.date_of_birth, student.photo, student.nationality, student.sexe, student.matricule, student.status_student, student.etat_student, student.year_id, student.parent_id, student.created_at, student.updated_at, student.deleted_at, parent.name_parent, parent.surnameParent, parent.contactParent, student_class.redouble');
        $builder->join("student_class", "student_class.student_id = student.student_id", "inner");
        $builder->join("class", "class.class_id = student_class.class_id", "inner");
        $builder->join("parent", "parent.parent_id = student.parent_id", "inner");
        $builder->join("year", "year.year_id = student_class.year_id", "inner");

        $builder->where('student_class.year_id', $year_id);
        $builder->where('student_class.class_id', $id_class);
        $builder->where('student_class.status_stu_class', 0);
        $builder->where('student_class.etat_stu_class', 'actif');
        $builder->where('student.sexe', $sexe);
        $builder->where('student.status_student', 0);
        $builder->where('student.etat_student', 'actif');
        $builder->where('class.status_class', 0);
        $builder->where('class.etat_class', 'actif');
        $builder->where('parent.status_parent', 0);
        $builder->where('parent.etat_parent', 'actif');
        $builder->orderBy('student.name', 'ASC');

        $res  = $builder->get();