app/Models/TeacherClassModel.php

    public function getTeacherClass($id_class, $year_id){
        $builder = $this->db->table('teacher_class');
        $builder->select('teacher.teacher_id, teacher.name, teacher.surname, ');
        $builder->join('class', 'class.class_id=teacher_class.class_id');
        $builder->join('teacher', 'teacher.teacher_id=teacher_class.teacher_id');

        $builder->where('teacher_class.class_id', $id_class);
        $builder->where('teacher_class.year_id', $year_id);
        $builder->where('teacher_class.etat_teacher_class', 'actif');
        $builder->where('teacher_class.status_teacher_class', 0);

        $builder->where('class.status_class', 0);
        $builder->where('class.etat_class', 'actif');

        $builder->where('teacher.status_teacher', 0);
        $builder->where('teacher.etat_teacher', 'actif');

        $res  = $builder->get();
---
SELECT `teacher`.`teacher_id`, `teacher`.`name`, `teacher`.`surname`
FROM `teacher_class`
JOIN `class` ON `class`.`class_id`=`teacher_class`.`class_id`
JOIN `teacher` ON `teacher`.`teacher_id`=`teacher_class`.`teacher_id`
WHERE `teacher_class`.`class_id` = '4'
AND `teacher_class`.`year_id` = 1
AND `teacher_class`.`etat_teacher_class` = 'actif'
AND `teacher_class`.`status_teacher_class` = 0
AND `class`.`status_class` = 0
AND `class`.`etat_class` = 'actif'
AND `teacher`.`status_teacher` = 0
AND `teacher`.`etat_teacher` = 'actif'