app/Models/TeachingUnitModel.php

    public function getTeachingById($id_teaching_unit){
        $builder = $this->db->table('teachingunit');
        $builder->select('*');
        $builder->where('teachingunit.teachingunit_id', $id_teaching_unit);
        $builder->where('teachingunit.status_teachingunit', 0);
        $builder->where('teachingunit.etat_teachingunit', 'actif');

        $res  = $builder->get();
---
SELECT *
FROM `teachingunit`
WHERE `teachingunit`.`teachingunit_id` = '1'
AND `teachingunit`.`status_teachingunit` = 0
AND `teachingunit`.`etat_teachingunit` = 'actif'