app/Models/TeacherModel.php

    public function getAllConnected($id_year){
        $builder = $this->db->table('teacher');
        $builder->select('teacher.matricule, teacher.name, teacher.surname, teacher.diplome, teacher.login, teacher.photo, teacher.tel, teacher.sexe, teacher.email');
        $builder->join('year', 'year.year_id=teacher.year_id', 'inner');

        $builder->join('teacher_class', 'teacher_class.teacher_id=teacher.teacher_id', 'inner');
        $builder->join('class', 'class.class_id=teacher_class.class_id', 'inner');
        $builder->where('teacher_class.year_id', $id_year);
        $builder->where('teacher_class.status_teacher_class', 0);
        $builder->where('teacher_class.etat_teacher_class', 'actif');

        $builder->where('teacher.status_teacher', 0);
        $builder->where('teacher.etat_teacher', 'actif');
        $builder->where('teacher.connected', 'true');

        $res  = $builder->get();
---
SELECT `teacher`.`matricule`, `teacher`.`name`, `teacher`.`surname`, `teacher`.`diplome`, `teacher`.`login`, `teacher`.`photo`, `teacher`.`tel`, `teacher`.`sexe`, `teacher`.`email`
FROM `teacher`
INNER JOIN `year` ON `year`.`year_id`=`teacher`.`year_id`
INNER JOIN `teacher_class` ON `teacher_class`.`teacher_id`=`teacher`.`teacher_id`
INNER JOIN `class` ON `class`.`class_id`=`teacher_class`.`class_id`
WHERE `teacher_class`.`year_id` = 1
AND `teacher_class`.`status_teacher_class` = 0
AND `teacher_class`.`etat_teacher_class` = 'actif'
AND `teacher`.`status_teacher` = 0
AND `teacher`.`etat_teacher` = 'actif'
AND `teacher`.`connected` = 'true'

    public function getAllTeacherYear($id_year){
        $builder = $this->db->table('teacher');
        $builder->select('teacher.matricule, teacher.name, teacher.surname, teacher.diplome, teacher.login, teacher.photo, teacher.tel, teacher.sexe, teacher.email');
        $builder->join('year', 'year.year_id=teacher.year_id', 'inner');
        $builder->where('teacher.year_id', $id_year);
        $builder->where('teacher.status_teacher', 0);
        $builder->where('teacher.etat_teacher', 'actif');

        $res  = $builder->get();
---
SELECT `teacher`.`matricule`, `teacher`.`name`, `teacher`.`surname`, `teacher`.`diplome`, `teacher`.`login`, `teacher`.`photo`, `teacher`.`tel`, `teacher`.`sexe`, `teacher`.`email`
FROM `teacher`
INNER JOIN `year` ON `year`.`year_id`=`teacher`.`year_id`
WHERE `teacher`.`year_id` = 1
AND `teacher`.`status_teacher` = 0
AND `teacher`.`etat_teacher` = 'actif'