app/Models/YearModel.php

SELECT *
FROM `year`
WHERE `status_year` = 0
AND `etat_year` = 'actif'
---
    public function getYearActif()
    {
        $builder = $this->db->table('year');
        $builder->select("*");
        $builder->where('status_year', 0);
        $builder->where('etat_year', 'actif');

        $res  = $builder->get();